Tekla.Structures.TeklaStructuresFiles.GetFileDictionaryByExtension(System.String,System.String)
Retrieves a dictionary of file names and their corresponding paths from multiple directories.
fileExtension: The file extension to filter the files by.
modelPath: The model path.
Returns: A dictionary containing file names without the extension and their paths.